# GetSketchCurves Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..GetSketchCurves Method
PartMakerMethodToDivideVolumes Class See Also
---
Populates the array with copies of curves in the sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void GetSketchCurves(
	out IList<Curve> curveArray
)
```

Visual Basic
---
```text
Public Sub GetSketchCurves ( _
	<OutAttribute> ByRef curveArray As IList(Of Curve) _
)
```

Visual C++
---
```text
public:
void GetSketchCurves(
	[OutAttribute] IList<Curve^>^% curveArray
)
```

# ### Parameters
curveArray
    Type: System.Collections.Generic..::..IList<(Of <(<'Curve>)>)>% Curves in the sketch. Tags of the curves are consistent with the curve tags used in part keys.
# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace